nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1181/mcuxpresso/startup_mimxrt1181.c
WEAK void Reserved197_IRQHandler(void)
{   Reserved197_DriverIRQHandler();
}

WEAK void Reserved198_IRQHandler(void)
{   Reserved198_DriverIRQHandler();
}

WEAK void Reserved199_IRQHandler(void)
{   Reserved199_DriverIRQHandler();
}

WEAK void Reserved200_IRQHandler(void)
{   Reserved200_DriverIRQHandler();
}

WEAK void EQDC1_IRQHandler(void)
{   EQDC1_DriverIRQHandler();
}

WEAK void EQDC2_IRQHandler(void)
{   EQDC2_DriverIRQHandler();
}

WEAK void Reserved203_IRQHandler(void)
{   Reserved203_DriverIRQHandler();
}

WEAK void Reserved204_IRQHandler(void)
{   Reserved204_DriverIRQHandler();
}

WEAK void Reserved205_IRQHandler(void)
{   Reserved205_DriverIRQHandler();
}

WEAK void DCDC_IRQHandler(void)
{   DCDC_DriverIRQHandler();
}

WEAK void Reserved207_IRQHandler(void)
{   Reserved207_DriverIRQHandler();
}

WEAK void Reserved208_IRQHandler(void)
{   Reserved208_DriverIRQHandler();
}

WEAK void DAC_IRQHandler(void)
{   DAC_DriverIRQHandler();
}

WEAK void Reserved210_IRQHandler(void)
{   Reserved210_DriverIRQHandler();
}

WEAK void Reserved211_IRQHandler(void)
{   Reserved211_DriverIRQHandler();
}

WEAK void LPUART7_IRQHandler(void)
{   LPUART7_DriverIRQHandler();
}

WEAK void LPUART8_IRQHandler(void)
{   LPUART8_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{   SAI2_DriverIRQHandler();
}

WEAK void SAI3_IRQHandler(void)
{   SAI3_DriverIRQHandler();
}

WEAK void ACMP1_IRQHandler(void)
{   ACMP1_DriverIRQHandler();
}

WEAK void ACMP2_IRQHandler(void)
{   ACMP2_DriverIRQHandler();
}

WEAK void ACMP3_IRQHandler(void)
{   ACMP3_DriverIRQHandler();
}

WEAK void ACMP4_IRQHandler(void)
{   ACMP4_DriverIRQHandler();
}

WEAK void CM7_PS_IRQHandler(void)
{   CM7_PS_DriverIRQHandler();
}

WEAK void CM7_MCM_IRQHandler(void)
{   CM7_MCM_DriverIRQHandler();
}

WEAK void CM33_MCM_IRQHandler(void)
{   CM33_MCM_DriverIRQHandler();
}

WEAK void Reserved223_IRQHandler(void)
{   Reserved223_DriverIRQHandler();
}

WEAK void SAFETY_CLK_MON_IRQHandler(void)
{   SAFETY_CLK_MON_DriverIRQHandler();
}

WEAK void GPT1_IRQHandler(void)
{   GPT1_DriverIRQHandler();
}

WEAK void GPT2_IRQHandler(void)
{   GPT2_DriverIRQHandler();
}

WEAK void KPP_IRQHandler(void)
{   KPP_DriverIRQHandler();
}

WEAK void Reserved228_IRQHandler(void)
{   Reserved228_DriverIRQHandler();
}

WEAK void Reserved229_IRQHandler(void)
{   Reserved229_DriverIRQHandler();
}

WEAK void Reserved230_IRQHandler(void)
{   Reserved230_DriverIRQHandler();
}

WEAK void Reserved231_IRQHandler(void)
{   Reserved231_DriverIRQHandler();
}

WEAK void FLEXSPI_SLV_IRQHandler(void)
{   FLEXSPI_SLV_DriverIRQHandler();
}

WEAK void NETC_IRQHandler(void)
{   NETC_DriverIRQHandler();
}

WEAK void MSGINTR1_IRQHandler(void)
{   MSGINTR1_DriverIRQHandler();
}

WEAK void MSGINTR2_IRQHandler(void)
{   MSGINTR2_DriverIRQHandler();
}

WEAK void MSGINTR3_IRQHandler(void)
{   MSGINTR3_DriverIRQHandler();
}

WEAK void MSGINTR4_IRQHandler(void)
{   MSGINTR4_DriverIRQHandler();
}

WEAK void MSGINTR5_IRQHandler(void)
{   MSGINTR5_DriverIRQHandler();
}

WEAK void MSGINTR6_IRQHandler(void)
{   MSGINTR6_DriverIRQHandler();
}

WEAK void Reserved240_IRQHandler(void)
{   Reserved240_DriverIRQHandler();
}

WEAK void Reserved241_IRQHandler(void)
{   Reserved241_DriverIRQHandler();
}

WEAK void Reserved242_IRQHandler(void)
{   Reserved242_DriverIRQHandler();
}

WEAK void Reserved243_IRQHandler(void)
{   Reserved243_DriverIRQHandler();
}

WEAK void Reserved244_IRQHandler(void)
{   Reserved244_DriverIRQHandler();
}

WEAK void Reserved245_IRQHandler(void)
{   Reserved245_DriverIRQHandler();
}

WEAK void Reserved246_IRQHandler(void)
{   Reserved246_DriverIRQHandler();
}

WEAK void Reserved247_IRQHandler(void)
{   Reserved247_DriverIRQHandler();
}

WEAK void GPIO4_IRQHandler(void)
{   GPIO4_DriverIRQHandler();
}

WEAK void TMR2_IRQHandler(void)
{   TMR2_DriverIRQHandler();
}

WEAK void GPIO5_IRQHandler(void)
{   GPIO5_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{   ASRC_DriverIRQHandler();
}

WEAK void GPIO6_IRQHandler(void)
{   GPIO6_DriverIRQHandler();
}

WEAK void DBG_TRACE_IRQHandler(void)
{   DBG_TRACE_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
